barkito_server/app/controllers/api/v1/auth_controller.rb

    def create
      @user = User.find_by(email:user_login_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]