barkito_server/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "username", "borough", "neighborhood", "street", "city", "zip_code", "gender", "description", "birth", "email", "password_digest", "vendor_admin", "performer_admin", "crew_member", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
<<<<<<< HEAD
    @user = User.new(user_params)

    if @user.save